电脑/linux/nginx/nginx学习笔记.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-01 二 00:09 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>nginx学习笔记</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">nginx学习笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline7">2. server</a>
<ul>
<li><a href="#orgheadline2">2.1. linsten</a></li>
<li><a href="#orgheadline3">2.2. server_name</a></li>
<li><a href="#orgheadline6">2.3. location</a>
<ul>
<li><a href="#orgheadline4">2.3.1. proxy_pass</a></li>
<li><a href="#orgheadline5">2.3.2. proxy_set_header</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline8">3. client_max_body_size</a></li>
<li><a href="#orgheadline9">4. 参考资料</a></li>
</ul>
</div>
</nav>

<div class="outline-2">
<h2 id="orgheadline1">前言</h2>
<div class="outline-text-2" id="text-1">
<p>
nginx的配置就是在 <code>/etc/nginx/sites-available</code> 那里新建一个配置文件，然后这样创建一个符号链接到 <code>sites-enabled</code> 那里。
</p>

<pre>
sudo ln -s /etc/nginx/sites-available/cdwanze.work /etc/nginx/sites-enabled/cdwanze.work
</pre>

<p>
然后重启nginx即可。 
</p>
<pre>
sudo service nginx restart
</pre>

<p>
nginx配置文件的基本格式是:
</p>
<pre>
&lt;section&gt; {
    &lt;directive&gt;  &lt;parameters&gt;;
}
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline7">server</h2>
<div class="outline-text-2" id="text-2">
</div><div class="outline-3">
<h3 id="orgheadline2">linsten</h3>
<div class="outline-text-3" id="text-2-1">
<p>
监听端口号
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline3">server_name</h3>
<div class="outline-text-3" id="text-2-2">
<pre>
server {
    listen 80;
    return 444;
}
</pre>

<p>
这个虚拟服务器没有设置 <code>server_name</code> ，意思是如果进来的HTTP请求请求头没有 <code>HOST</code> 这一行，则将由该虚拟服务器处理。这里就是简单的返回444状态码。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline6">location</h3>
<div class="outline-text-3" id="text-2-3">
<p>
比如:
</p>
<pre>
location / {
    proxy_pass http://127.0.0.1:5000;
}
</pre>

<p>
就是描述了在遇到 <code>/</code> 的时候如何处理。
</p>
</div>

<div class="outline-4">
<h4 id="orgheadline4">proxy_pass</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
代理传递，也就是比如说python的flask框架在后台端口5000运行， <code>/</code> 这样的请求将传递给flask的app来处理。这里值得提醒的是location的uri分发规则较为复杂，目前我们需要知道的是， <code>/</code> 是一个通用匹配，就是如果是精确匹配，当然就选这个规则，如果有其他规则匹配，则用其他规则，否则最后就考虑使用这个通用规则。更多信息请参看 <a href="http://seanlook.com/2015/05/17/nginx-location-rewrite/">这个网页</a> 。
</p>

<p>
这种反向代理，一个很重要的知识点就是uri的改写规则。这里面东西也很多，比如下面的这个:
</p>
<pre>
location /socket.io {
    proxy_pass http://127.0.0.1:5000/socket.io;
}
</pre>

<p>
匹配到的部分会被改写为 <code>http://127.0.0.1:5000/socket.io</code> 但是也有些例外的情况，以后再详细讨论之。
</p>
</div>
</div>

<div class="outline-4">
<h4 id="orgheadline5">proxy_set_header</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
比如websocket协议部分的转发，需要对header做如下一些修改:
</p>
<pre>
proxy_http_version 1.1;    
proxy_set_header Upgrade $http_upgrade;
proxy_set_header Connection "upgrade";
</pre>

<p>
具体就是送入upstream 服务器的header加上这两行:
</p>
<pre>
Upgrade: websocket
Connection: Upgrade
</pre>
<p>
这里所谓的upstream服务器，在nginx实际上就可以简单看作一个汇总性质的服务器，因为我们前面看到了nginx下面有很多虚拟的server，那么这个upstream可以看作最终面向客户端的那个服务器。初步的理解就是这么个意思。
</p>
</div>
</div>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline8">client_max_body_size</h2>
<div class="outline-text-2" id="text-3">
<p>
nginx请求实体过大错误信息:
</p>
<pre>
Nginx 413 Request Entity Too Large
</pre>

<p>
参考了 <a href="http://www.cyberciti.biz/faq/linux-unix-bsd-nginx-413-request-entity-too-large/">这个网页</a> ，你需要在 <code>/usr/local/nginx/conf/nginx.conf</code> 里添加或修改这一行:
</p>

<pre>
# set client body size to 2M #
client_max_body_size 2M;
</pre>

<p>
然后重启nginx或者reload nginx即可。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline9">参考资料</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>mastering nginx</li>
</ol>
</div>
</div>
</div>
</body>
</html>
